davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
#include "display_service.h"

/* THE ESP32 HALF OF THIS FILE IS OFF THE SHIM (phase C step 14). The 41 Wire transactions and
 * 13+4 read clusters went to od_hal_i2c, GPIO to od_hal_gpio, millis/delay to od_hal_time, and
 * the one analogRead() to od_hal_adc.
 *
 * <Arduino.h> STAYS, guarded, and this file stays on the ratchet's list -- its TARGET_NRF arms
 * still need it (epdBsPinLowIfNrf()'s pinMode/digitalWrite and prepareEpdRailForBoot()'s two
 * delay(50) calls). Eight call sites, none of which compiles on this target, so none can be
 * verified here. Same rule main.cpp, buzzer_hw.cpp, device_control.cpp and encryption.cpp are
 * counted under; they leave together at MIGRATION step 4.
 *
 * Do NOT drop this include to make the number go down -- that is the laundered decrement
 * compat/SHIM_BUDGET exists to catch. */
#ifdef TARGET_NRF
#include <Arduino.h>
#endif
#include <bb_epaper.h>
#include <string.h>
#include "od_hal_i2c.h"
#include "od_hal_gpio.h"
#include "od_hal_time.h"
#include "od_hal_adc.h"
#include "structs.h"
/* shared/core: the 16-byte MSD encoding. This target no longer assembles those bytes. */
#include "od_advert.h"
/* OD-PORT: two panel IC values this file compares against are missing from
 * shared/protocol/ -- they were added to Firmware's VENDORED copy of the wire contract
 * and never propagated to canonical. See protocol_pending.h; it is a debt with a
 * documented removal sequence, not a second home for wire constants. */
#include "protocol_pending.h"
#include "od_log.h"
#include "buzzer_control.h"
#include "sensor_sht40.h"
#include "sensor_bq27220.h"
#include "communication.h"
#include "encryption.h"
#include "boot_screen.h"
#include "link_owner.h"
#include "session_guard.h"
#include "touch_input.h"
#include "uzlib.h"
#if defined(TARGET_ESP32) && defined(OPENDISPLAY_FASTEPD)
#include "display_fastepd.h"
#endif

// On ESP32-WiFi BUILDS, route this file's streaming-inflate calls to the ROM `tinfl`
// engine (src/od_inflate_tinfl.*) instead of the uzlib bit-serial inflater. uzlib
// (lib/uzlib) is left completely untouched — it is simply not called here, so the
// linker drops it. The od_zlib_stream_* call sites below are unchanged; the macros
// rebind them at compile time. od_zlib_status_t / OD_ZLIB_STATUS_* stay shared
// (from uzlib.h).
//
// This remap is UNCONDITIONAL within such a build — it is not gated per transport, so
// it rebinds EVERY compressed path in this file: direct-write (0x70/0x71), partial
// region (0x76), and PIPE_WRITE (0x80-0x82). PIPE_WRITE is BLE-only, so BLE transfers
// decode through tinfl here too. The WiFi keying of OPENDISPLAY_USE_TINFL selects
// which builds opt in (the LAN wire is what makes software inflate the bottleneck and
// justifies tinfl's ~11 KB of DRAM tables, and that flag is now set only on PSRAM
// envs, so a part without the DRAM budget never opts in); it does NOT restrict the
// engine to LAN traffic. See od_inflate_tinfl.h for the full rationale and RAM cost.
#include "od_inflate_tinfl.h"
#if OPENDISPLAY_USE_TINFL
#define od_zlib_stream_reset  od_inflate_tinfl_reset
#define od_zlib_stream_push   od_inflate_tinfl_push
#define od_zlib_stream_poll   od_inflate_tinfl_poll
#define od_zlib_stream_error  od_inflate_tinfl_error
#endif

#ifdef TARGET_NRF
extern "C" {
#include "nrf_soc.h"
}
#include "nrf.h"
#endif

#ifdef TARGET_ESP32
#include "wifi_service.h"
#include "od_bbep_stream.h"
#endif

#include "ble_transport.h"
#include "command_queue.h"

extern BBEPDISP bbep;
extern struct GlobalConfig globalConfig;
extern uint8_t msd_payload[16];
extern uint8_t dynamicreturndata[11];
extern uint8_t rebootFlag;
extern uint8_t activeLedInstance;
extern bool connectionRequested;
extern uint8_t mloopcounter;
extern bool displayPowerState;
// EPD panel power state machine — variables DEFINED in main.h TU; enum +
// EPD_KEEPALIVE_MAX_S live in display_service.h.
extern volatile uint8_t pwrmgmState;
extern uint32_t pwrmgmOffDeadlineMs;
extern volatile uint8_t pwrmgmLock;
extern uint32_t directWriteStartTime;
extern uint32_t directWriteCompressedReceived;
extern uint8_t directWriteRefreshMode;
extern uint32_t directWriteTotalBytes;
extern uint16_t directWriteHeight;
extern uint16_t directWriteWidth;
extern uint32_t directWriteDecompressedTotal;
extern uint32_t directWriteBytesWritten;
extern bool directWritePlane2;
extern bool directWriteBitplanes;
extern bool directWriteCompressed;
extern bool directWriteActive;
extern uint8_t decompressionChunk[OPENDISPLAY_DECOMPRESSION_CHUNK_SIZE];
volatile bool epdRefreshInProgress = false;

// The ONE place the refresh bracket is closed, on every path.
//
// Both bracket sites used to assign epdRefreshInProgress = false inline. Routing
// them through a helper is what makes the R4 refresh exclusion implementable: a
// loop-side edge detector cannot see this transition, because loop() does not run
// for the refresh's whole duration -- both edges happen inside the blocking
// handler while wall-clock time passes. The activity clock has to be re-stamped AT
// the transition or a naive od_hal_uptime_ms()-lastStamp accrues the entire refresh and drops
// an actively engaged client the instant loop() resumes.
//
// Re-stamping can only ever DELAY a drop, never cause a spurious one, which is why
// it is safe to apply unconditionally here. A future third refresh path gets the
// exclusion by calling this instead of remembering a second statement.
void endRefresh(void) {
    epdRefreshInProgress = false;
    linkStampRefreshEnd();
}

extern uint32_t displayed_etag;

// 0x76 partial-write error codes come from the canonical opendisplay_protocol.h;
// use OD_ERR_PARTIAL_* directly at the call sites rather than shadowing them here
// (the OD_ERR_PIPE_START_* family reuses the same byte values with DIFFERENT
// meanings, so a local copy is a drift/mix-up hazard). For reference:
//   OD_ERR_PARTIAL_ETAG_MISMATCH  0x01   old_etag != displayed etag
//   OD_ERR_PARTIAL_RECT_OOB       0x03   rectangle out of panel bounds
//   OD_ERR_PARTIAL_RECT_ALIGN     0x04   x / width not a multiple of 8
//   OD_ERR_PARTIAL_FLAGS          0x05   bad / unsupported flags
//   OD_ERR_PARTIAL_STREAM         0x06   stream / length error
//   OD_ERR_PARTIAL_UNSUPPORTED    0x07   partial write unsupported (e.g. not 1bpp)

