davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
// TODO(protocol): the canonical header defines no partial-write flag constant;
// the 0x76 path reuses the bit0=compressed convention. Add an OD_PARTIAL_FLAG_*
// (or reuse a shared flag) upstream in opendisplay-protocol, then drop this local.
static const uint8_t PARTIAL_FLAG_COMPRESSED = 0x01u;
static const uint8_t PARTIAL_ALLOWED_FLAGS = PARTIAL_FLAG_COMPRESSED;

struct PartialStreamContext {
    bool active;
    bool compressed;
    uint8_t flags;
    uint32_t new_etag;
    uint16_t x;
    uint16_t y;
    uint16_t width;
    uint16_t height;
    uint32_t expected_stream_size;
    uint32_t plane_size;
    uint32_t bytes_received;
    uint32_t bytes_written;
    uint8_t current_plane;
    uint32_t start_time;
};

void pwrmgm(bool onoff);
void bbepInitIO(BBEPDISP *pBBEP, uint8_t u8DC, uint8_t u8RST, uint8_t u8BUSY, uint8_t u8CS, uint8_t u8MOSI, uint8_t u8SCK, uint32_t u32Speed);
void bbepWakeUp(BBEPDISP *pBBEP);
void bbepSendCMDSequence(BBEPDISP *pBBEP, const uint8_t *pSeq);
void bbepRefresh(BBEPDISP *pBBEP, int iMode);
void bbepSleep(BBEPDISP *pBBEP, int iMode);
void bbepSetAddrWindow(BBEPDISP *pBBEP, int x, int y, int cx, int cy);
void bbepStartWrite(BBEPDISP *pBBEP, int iPlane);
void bbepWriteData(BBEPDISP *pBBEP, uint8_t *pData, int iLen);
void bbepFill(BBEPDISP *pBBEP, unsigned char ucColor, int iPlane);
void bbepWriteCmd(BBEPDISP *pBBEP, uint8_t cmd);
void bbepCMD2(BBEPDISP *pBBEP, uint8_t cmd1, uint8_t cmd2);
void bbepWaitBusy(BBEPDISP *pBBEP);
/* NOT an upstream bb_epaper function -- provided by panel/od_bbep_idf_io.inl, this target's own
 * IO backend. Upstream has no teardown at all, which is what made every re-init a workaround:
 * the bus was never released, so a second spi_bus_initialize() could only fail. See
 * docs/BBEPAPER_IO_BACKENDS.md. */
void bbepDeInitIO(void);
bool bbepIsBusy(BBEPDISP *pBBEP);
#ifdef BBEP_T133A01
void bbepSetCS2(BBEPDISP *pBBEP, uint8_t cs);
void bbepWriteCmdData(BBEPDISP *pBBEP, uint8_t cmd, const uint8_t *pData, int iLen);
void bbepStartDataStream(BBEPDISP *pBBEP, uint8_t cmd);
void bbepWriteDataStreamByte(BBEPDISP *pBBEP, uint8_t data);
void bbepEndDataStream(BBEPDISP *pBBEP);
#endif
void flashLed(uint8_t color, uint8_t brightness);
bool waitforrefresh(int timeout);

#ifdef TARGET_NRF
static bool nrfVbusPresent() {
    //ignored for now
    //return (NRF_POWER->USBREGSTATUS & POWER_USBREGSTATUS_VBUSDETECT_Msk) != 0;
    return false;
}
#else
static bool nrfVbusPresent() { return true; }
#endif

static void epdBsPinLowIfNrf() {
#ifdef TARGET_NRF
    pinMode(13, OUTPUT);
    digitalWrite(13, LOW);
#endif
}

// Battery boot: power-cycle the panel rail once. pwrmgm(true) already waits ~900 ms
// per enable; extra delays here are only for rail discharge between off/on.
static void prepareEpdRailForBoot() {
    epdBsPinLowIfNrf();
    pwrmgm(true);
#ifdef TARGET_NRF
    if (!nrfVbusPresent()) {
        delay(50);
        pwrmgm(false);
        delay(50);
        epdBsPinLowIfNrf();
        pwrmgm(true);
    }
#endif
}

#ifdef BBEP_T133A01
// CS2 must be set before bbepInitIO() so dual-chip init reaches both controllers.
static void e1004InitPanel(void) {
    const DisplayConfig& d = globalConfig.displays[0];
    bbepSetCS2(&bbep, e1004_cs2_pin());
    bbepInitIO(&bbep, d.dc_pin, d.reset_pin, d.busy_pin, d.cs_pin, d.data_pin, d.clk_pin, 8000000);
}

// Half-panel DTM for bwgbry_split: CS held for left half, then right (no FB).
static bool e1004GeometryOk = false;
static bool e1004StreamOpen = false;
static bool e1004OnLeftHalf = true;
static uint32_t e1004HalfBytesWritten = 0;
static uint32_t e1004HalfPlaneBytes = 0;

void e1004_end_plane(void);

static uint8_t e1004_panel_byte(uint8_t packed) {
    auto nibble = [](uint8_t c) -> uint8_t {
        c &= 0x0f;
        switch (c) {
        case 0x00: case 0x01: case 0x02: case 0x03: case 0x05: case 0x06:
            return c;
        default:
            return 0x00;
        }
    };
    return (uint8_t)((nibble(packed >> 4) << 4) | nibble(packed));
}

static void e1004_ccset_both(void) {
    uint8_t data = 0x01;
    od_hal_gpio_write(bbep.iCS2Pin, false);
    bbep.iCSPin = bbep.iCS1Pin;
    bbepWriteCmdData(&bbep, 0xe0, &data, 1);
    od_hal_gpio_write(bbep.iCS2Pin, true);
    bbep.iCSPin = bbep.iCS1Pin;
    bbepWaitBusy(&bbep);
    od_hal_delay_ms(10);
}

static uint32_t e1004_half_plane_bytes(void) {
    return ((uint32_t)bbep.native_width / 4u) * (uint32_t)bbep.native_height;
}

bool e1004_begin_plane(void) {
    if (!e1004_panel_used() || !e1004GeometryOk) return false;
    if (e1004StreamOpen) e1004_end_plane();
    e1004_ccset_both();
    e1004HalfPlaneBytes = e1004_half_plane_bytes();
    e1004HalfBytesWritten = 0;
    e1004OnLeftHalf = true;
    bbep.iCSPin = bbep.iCS1Pin;
    bbepStartDataStream(&bbep, UC8151_DTM1);
    /* Payload now goes to the bb_epaper backend's SPI device, not the Arduino SPI object in
     * vendor/fastepd. Those were TWO devices on SPI2_HOST -- see panel/od_bbep_stream.h.
     * Opened after bbepStartDataStream() because that issues the controller's data-write
     * command, which needs the backend's own CS framing. */
    od_bbep_stream_begin(bbep.iCSPin);
    e1004StreamOpen = true;
    return true;
}

bool e1004_advance_to_cs2(void) {
    if (!e1004StreamOpen || !e1004OnLeftHalf) return false;
    od_bbep_stream_end();          /* release CS1 before the command frames below */
    bbepEndDataStream(&bbep);
    e1004OnLeftHalf = false;
    e1004HalfBytesWritten = 0;
    bbep.iCSPin = bbep.iCS2Pin;
    bbepStartDataStream(&bbep, UC8151_DTM1);
    od_bbep_stream_begin(bbep.iCSPin);   /* ...and hold CS2 for the right half */
    return true;
}

void e1004_end_plane(void) {
    if (!e1004StreamOpen) return;
    od_bbep_stream_end();
    bbepEndDataStream(&bbep);
    bbep.iCSPin = bbep.iCS1Pin;
    e1004StreamOpen = false;
    e1004OnLeftHalf = true;
    e1004HalfBytesWritten = 0;
}

void e1004_write_stream_bytes(const uint8_t* data, uint16_t len) {
    if (!e1004StreamOpen || !data || len == 0) return;
    uint8_t scratch[128];
    uint16_t off = 0;
    while (off < len) {
        uint16_t n = (uint16_t)(len - off);
        if (n > sizeof(scratch)) n = sizeof(scratch);
        for (uint16_t i = 0; i < n; i++) scratch[i] = e1004_panel_byte(data[off + i]);
        od_bbep_stream_write(scratch, n);
        off = (uint16_t)(off + n);
    }
    e1004HalfBytesWritten += len;
}

static void e1004_sink_bytes(uint8_t* data, uint32_t len) {
    while (len > 0 && e1004StreamOpen) {
        if (e1004HalfPlaneBytes == 0) return;
        uint32_t space = e1004HalfPlaneBytes - e1004HalfBytesWritten;
        if (space == 0) {
            if (e1004OnLeftHalf) {
                if (!e1004_advance_to_cs2()) return;
                continue;
            }
            return;
        }
        uint16_t take = (len < space) ? (uint16_t)len : (uint16_t)((space > 0xFFFFu) ? 0xFFFFu : space);
        e1004_write_stream_bytes(data, take);
        data += take;
        len -= take;
        if (e1004OnLeftHalf && e1004HalfBytesWritten >= e1004HalfPlaneBytes) {
            if (!e1004_advance_to_cs2()) return;
        }
    }
}
#else
bool e1004_begin_plane(void) { return false; }
bool e1004_advance_to_cs2(void) { return false; }
void e1004_end_plane(void) {}
void e1004_write_stream_bytes(const uint8_t* data, uint16_t len) { (void)data; (void)len; }
#endif

// bb_epaper 71f6e70 replaced EP397/EP426 full-init RAM windows with SET_ORIENTATION
// (flip180=0 → 0x11=0x02 on 800-wide) while part inits and our partial helpers still
// use the pre-change windows. Re-apply those so full and partial share one map.
static void epdAlignCustomPartialRamMode(void) {
    uint8_t uc[4];
    if (bbep.type == EP397_800x480 || bbep.type == EP397_800x480_4GRAY) {
        bbepCMD2(&bbep, SSD1608_DATA_MODE, 0x01);
        bbepWriteCmd(&bbep, SSD1608_SET_RAMXPOS);
        uc[0] = 0x00; uc[1] = 0x00; uc[2] = 0x1f; uc[3] = 0x03;
        bbepWriteData(&bbep, uc, 4);
        bbepWriteCmd(&bbep, SSD1608_SET_RAMYPOS);
        uc[0] = 0xdf; uc[1] = 0x01; uc[2] = 0x00; uc[3] = 0x00;
        bbepWriteData(&bbep, uc, 4);
        bbepWriteCmd(&bbep, SSD1608_SET_RAMXCOUNT);
        uc[0] = 0x00; uc[1] = 0x00;
        bbepWriteData(&bbep, uc, 2);
        bbepWriteCmd(&bbep, SSD1608_SET_RAMYCOUNT);
        uc[0] = 0x00; uc[1] = 0x00;
        bbepWriteData(&bbep, uc, 2);
    } else if (bbep.type == EP426_800x480 || bbep.type == EP426_800x480_4GRAY) {
        bbepCMD2(&bbep, SSD1608_DATA_MODE, 0x02);
        bbepWriteCmd(&bbep, SSD1608_SET_RAMXPOS);
        uc[0] = 0x1f; uc[1] = 0x03; uc[2] = 0x00; uc[3] = 0x00;
        bbepWriteData(&bbep, uc, 4);
        bbepWriteCmd(&bbep, SSD1608_SET_RAMYPOS);
        uc[0] = 0x00; uc[1] = 0x00; uc[2] = 0xdf; uc[3] = 0x01;
        bbepWriteData(&bbep, uc, 4);
        bbepWriteCmd(&bbep, SSD1608_SET_RAMXCOUNT);
        uc[0] = 0x1f; uc[1] = 0x03;
        bbepWriteData(&bbep, uc, 2);
        bbepWriteCmd(&bbep, SSD1608_SET_RAMYCOUNT);
        uc[0] = 0x00; uc[1] = 0x00;
        bbepWriteData(&bbep, uc, 2);
    }
}

static void initBbepPanelSession() {
    const DisplayConfig& d = globalConfig.displays[0];
#ifdef BBEP_T133A01
    if (e1004_panel_used()) {
        e1004InitPanel();
        od_hal_delay_ms(200);
        return;
    }
#endif
    bbepInitIO(&bbep, d.dc_pin, d.reset_pin, d.busy_pin, d.cs_pin, d.data_pin, d.clk_pin, 8000000);
    bbepWakeUp(&bbep);
    bbepSendCMDSequence(&bbep, bbep.pInitFull);
    epdAlignCustomPartialRamMode();
    od_hal_delay_ms(200);
}

// ---------------------------------------------------------------------------
// EPD panel power session (keep-alive) — see the state-machine design.
// pwrmgm() owns the OFF<->(ACTIVE) rail transitions and is the sole rail actuator;
// these helpers own the ACTIVE<->WARM transitions plus the keep-alive timer.
// ---------------------------------------------------------------------------

// Which init sequence is loaded in the controller (partial vs full). Panel-init
// bookkeeping, not power state — stays file-static here (Phase 2a uses it).
static bool epdSessionInitWasPartial = false;
// Phase 2b plane-consistency flag: true after a successful partial refresh leaves
// both controller planes consistent. Cleared on ForceOff / full-frame acquire.
// Not consulted for fill-skip in Phase 1 (full-frame skip is unconditional-safe).
static bool epdPlanesPrepared = false;

static bool epdSessionUsesFastepd(void) {
#if defined(TARGET_ESP32) && defined(OPENDISPLAY_FASTEPD)
    return fastepd_driver_used();
#else
    return false;
#endif
}

// Keep-alive window from config: screen_timeout_seconds, clamped to EPD_KEEPALIVE_MAX_S;
// 0 (also the old-blob/factory default) -> Release powers the panel straight down.
// Forced to 0 on AXP2101 boards regardless of config (PMIC warm idle draw unmeasured) —
// announced on the log whenever the override suppresses a non-zero configured value.
static uint32_t epdKeepAliveWindowMs(void) {
    uint8_t s = globalConfig.power_option.screen_timeout_seconds;
    for (uint8_t i = 0; i < globalConfig.sensor_count; i++) {
        if (globalConfig.sensors[i].sensor_type == OD_SENSOR_TYPE_AXP2101) {
            if (s != 0) {
                od_log_info("[EPD session] AXP2101 present - keep-alive forced off (screen_timeout_seconds ignored)");
            }
            return 0;
        }
    }
    if (s > EPD_KEEPALIVE_MAX_S) s = EPD_KEEPALIVE_MAX_S;
    return (uint32_t)s * 1000;
}

