davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
// Session try-lock, now UNCONTENDED on both targets and kept as defence in depth.
//
// It existed because nRF dispatched commands on the Bluefruit write-callback
// task while the keep-alive tick ran on loop(): a transfer could Acquire on one
// task while ForceOff rail-cut on the other. Phase 3 moved nRF dispatch to
// loop(), so every Acquire/Release/ForceOff/tick caller is now that single task
// (see docs/PLAN_BLE_TRANSPORT_ABSTRACTION_2026-07-27.md).
//
// Kept rather than deleted: it is nearly free, it still guards against a future
// caller arriving from an ISR or another task, and the try-lock in the tick is
// what keeps a rail-cut from landing mid-init regardless of who calls it.
static void pwrmgmLockTake(void) {
    // The yield here is now belt-and-braces. It was load-bearing under the old
    // model: this ran on the Bluefruit callback task, which outranks the loop
    // task holding the lock during the tick's ForceOff (SPI ops + od_hal_delay_ms(50)), so
    // a bare busy-spin starved the lower-priority holder forever on the single
    // core (priority-inversion livelock). With one task there is nothing to spin
    // against, but od_hal_delay_ms(1) is vTaskDelay and stays correct if that ever changes.
    while (__atomic_exchange_n(&pwrmgmLock, 1, __ATOMIC_ACQUIRE)) { od_hal_delay_ms(1); }
}
static bool pwrmgmLockTryTake(void) {
    return __atomic_exchange_n(&pwrmgmLock, 1, __ATOMIC_ACQUIRE) == 0;
}
static void pwrmgmLockGive(void) {
    __atomic_store_n(&pwrmgmLock, 0, __ATOMIC_RELEASE);
}

// Lock-held core (callers must hold pwrmgmLock). Split out so Release/Tick can
// power off without re-taking the non-recursive lock.
static void epdSessionForceOffLocked(void) {
    if (pwrmgmState == PWR_OFF) return;   // idempotent
    od_log_info("[EPD session] force off");
    if (epdSessionUsesFastepd()) {
#if defined(TARGET_ESP32) && defined(OPENDISPLAY_FASTEPD)
        fastepd_direct_sleep();
        // Rail is about to drop: force the next push to fully re-init the TCON
        // rather than wake() a power-cycled IT8951 (garbled refresh otherwise).
        fastepd_mark_hw_deinitialized();
#endif
    } else {
        bbepSleep(&bbep, 1);
        od_hal_delay_ms(50);
        /* Release the SPI bus and device now that the controller is asleep and no further
         * bytes are going out. Must be AFTER bbepSleep(), which still needs the bus to send
         * the sleep command, and BEFORE pwrmgm(false), which cuts the rail and parks the pins.
         *
         * This is what makes the next cold bring-up a clean spi_bus_initialize() rather than a
         * re-init of a bus nobody owns -- and re-initialising is not optional, because
         * configureDisplayPinsLowPower() inside pwrmgm(false) takes SCLK/MOSI back as plain
         * GPIO and only spi_bus_initialize() re-attaches them to the peripheral. Idempotent,
         * so the abort paths that reach here twice cost nothing. */
        bbepDeInitIO();
    }
    pwrmgm(false);   // -> PWR_OFF, clears deadline
    epdPlanesPrepared = false;
}

/* Whether pwrmgm() will drive an AXP2101 PMIC on this board, i.e. whether its timing includes
 * initAXP2101() over I2C on top of the rail assert and the 800 ms settle. Same scan pwrmgm()
 * itself does -- duplicated rather than exported because it exists only to label a log line,
 * and a second caller of a one-line predicate is cheaper than a new cross-file dependency. */
static bool epdRailUsesAxp2101(void) {
    for (uint8_t i = 0; i < globalConfig.sensor_count; i++) {
        if (globalConfig.sensors[i].sensor_type == OD_SENSOR_TYPE_AXP2101) return true;
    }
    return false;
}

// Bring the panel up for a transfer/refresh. Returns true iff it was COLD (rail
// was off) — callers may need to (re)open the address window regardless.
static bool epdSessionAcquire(bool partialInit) {
    pwrmgmLockTake();
    bool cold;
    const uint32_t tAcquire = od_hal_uptime_ms();
    if (pwrmgmState == PWR_OFF) {
        od_log_info("[EPD session] acquire: COLD bring-up");
        /* pwrmgm(true) FIRST, and timed: it asserts the panel rail, waits 800 ms for it to
         * settle, and -- when an AXP2101 PMIC is configured -- runs initAXP2101() over I2C.
         * That is the largest unattributed block on this path and it runs before any panel
         * byte moves, so a stall here must not be misread as a panel that will not answer. */
        uint32_t tRail = od_hal_uptime_ms();
        pwrmgm(true);   // -> PWR_ACTIVE (guarded; real transition)
        od_log_debug("[EPD cold] pwrmgm(on) %u ms (rail + 800 ms settle%s)",
                     (unsigned)(od_hal_uptime_ms() - tRail),
                     epdRailUsesAxp2101() ? " + AXP2101 I2C" : "");
        if (!epdSessionUsesFastepd()) {
            const DisplayConfig& d = globalConfig.displays[0];
#ifdef BBEP_T133A01
            if (e1004_panel_used()) {
                e1004InitPanel();
                epdSessionInitWasPartial = false;
            } else
#endif
            {
                /* Per-step timing. A cold bring-up is three vendor calls and, when the panel
                 * is not answering, each one silently burns a full BUSY timeout (5 s B/W,
                 * 30 s multi-colour) inside bb_epaper and returns success. From the outside
                 * that is one opaque 16-30 s stall between "COLD bring-up" and the next line
                 * -- which blocks loop(), so queued BLE responses cannot be notified and the
                 * host times out. Naming the step that costs the time is the difference
                 * between reading a log and guessing. Cheap: four log lines per cold acquire,
                 * not per transfer. */
                uint32_t tStep = od_hal_uptime_ms();
                bbepInitIO(&bbep, d.dc_pin, d.reset_pin, d.busy_pin, d.cs_pin, d.data_pin, d.clk_pin, 8000000);
                od_log_debug("[EPD cold] bbepInitIO %u ms", (unsigned)(od_hal_uptime_ms() - tStep));

                tStep = od_hal_uptime_ms();
                bbepWakeUp(&bbep);
                od_log_debug("[EPD cold] bbepWakeUp %u ms", (unsigned)(od_hal_uptime_ms() - tStep));

                const uint8_t* initSeq = partialInit ? (bbep.pInitPart ? bbep.pInitPart : bbep.pInitFull)
                                                     : bbep.pInitFull;
                tStep = od_hal_uptime_ms();
                bbepSendCMDSequence(&bbep, initSeq);
                od_log_debug("[EPD cold] initSeq (%s) %u ms",
                             partialInit ? "partial" : "full", (unsigned)(od_hal_uptime_ms() - tStep));
                tStep = od_hal_uptime_ms();
                epdAlignCustomPartialRamMode();
                od_log_debug("[EPD cold] alignRamMode %u ms", (unsigned)(od_hal_uptime_ms() - tStep));
                epdSessionInitWasPartial = partialInit;
            }
        }
        cold = true;
    } else {
        // WARM re-acquire (or, defensively, an already-ACTIVE re-entry).
        od_log_info(pwrmgmState == PWR_ACTIVE ? "[EPD session] acquire: already ACTIVE (defensive)"
                                              : "[EPD session] acquire: WARM re-acquire");
        pwrmgmState = PWR_ACTIVE;
        pwrmgmOffDeadlineMs = 0;   // cancel keep-alive
        // Phase 1: full re-init on warm re-acquire (HW reset => registers identical
        // to cold, safest). Phase 2a will skip bbepWakeUp + resend only on change.
        if (!epdSessionUsesFastepd()) {
#ifdef BBEP_T133A01
            if (e1004_panel_used()) {
                epdSessionInitWasPartial = false;
            } else
#endif
            {
                /* Same breakdown as the cold path. A WARM re-acquire skips the rail and the
                 * SPI bring-up, so if it ALSO stalls then the panel is not answering for a
                 * reason unrelated to power -- which is worth being able to tell apart. */
                uint32_t tStep = od_hal_uptime_ms();
                bbepWakeUp(&bbep);
                od_log_debug("[EPD warm] bbepWakeUp %u ms", (unsigned)(od_hal_uptime_ms() - tStep));
                const uint8_t* initSeq = partialInit ? (bbep.pInitPart ? bbep.pInitPart : bbep.pInitFull)
                                                     : bbep.pInitFull;
                tStep = od_hal_uptime_ms();
                bbepSendCMDSequence(&bbep, initSeq);
                od_log_debug("[EPD warm] initSeq (%s) %u ms",
                             partialInit ? "partial" : "full", (unsigned)(od_hal_uptime_ms() - tStep));
                epdAlignCustomPartialRamMode();
                epdSessionInitWasPartial = partialInit;
            }
        }
        cold = false;
    }
    /* The total, so the per-step lines above can be checked to add up. A large total with
     * small parts means the time is somewhere still uninstrumented -- which is exactly the
     * ambiguity the first instrumented build left, and the reason this line exists. */
    od_log_info("[EPD session] acquire done: %s, %u ms total",
                cold ? "COLD" : "WARM", (unsigned)(od_hal_uptime_ms() - tAcquire));
    pwrmgmLockGive();
    return cold;
}

// Finish a transfer/refresh. On success (and when keep-alive is enabled) the panel
// stays powered + AWAKE and enters PWR_WARM with an armed deadline; otherwise it is
// powered fully down now.
static void epdSessionRelease(bool refreshSuccess) {
    pwrmgmLockTake();
    if (pwrmgmState == PWR_OFF) { pwrmgmLockGive(); return; }   // nothing to release
    uint32_t window = epdKeepAliveWindowMs();
    if (window == 0 || !refreshSuccess) {
        od_log_info(refreshSuccess ? "[EPD session] release: keep-alive disabled, powering off"
                                   : "[EPD session] release: refresh failed, powering off");
        epdSessionForceOffLocked();
    } else {
        pwrmgmState = PWR_WARM;
        pwrmgmOffDeadlineMs = od_hal_uptime_ms() + window;
        // Controller stays AWAKE (no bbepSleep; is_awake stays 1); rail/SPI stay up.
        od_log_info("[EPD session] release: panel warm-idle, off in %u ms", (unsigned)window);
    }
    pwrmgmLockGive();
}

void epdSessionForceOff(void) {
    pwrmgmLockTake();
    epdSessionForceOffLocked();
    pwrmgmLockGive();
}

void epdSessionTick(void) {
    if (pwrmgmState != PWR_WARM) return;   // fast pre-check (only WARM arms the timer)
    if (!pwrmgmLockTryTake()) return;      // held by a transfer -> skip this pass
    // Re-check under the lock: a transfer may have moved us out of WARM meanwhile.
    if (pwrmgmState == PWR_WARM && (int32_t)(od_hal_uptime_ms() - pwrmgmOffDeadlineMs) >= 0) {
        od_log_info("[EPD session] keep-alive expired — powering panel off");
        epdSessionForceOffLocked();
    }
    pwrmgmLockGive();
}

bool epdSessionIsWarm(void) {
    return pwrmgmState == PWR_WARM;
}

