davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
bool openDisplayI2cBusConfigured(void) {
    for (uint8_t i = 0; i < globalConfig.data_bus_count; i++) {
        if (i2cDataBusValid(i)) {
            return true;
        }
    }
    return false;
}

void invalidateOpenDisplayWire(void) {
#ifdef TARGET_ESP32
    if (s_wire_open_display_ready) {
        od_hal_i2c_deinit();
    }
    s_wire_open_display_ready = false;
#endif
}

bool initOrRestoreWireForBus(uint8_t bus_id) {
#ifdef TARGET_ESP32
    if (bus_id == 0xFF) {
        bus_id = 0;
    }
    if (!i2cDataBusValid(bus_id)) {
        return false;
    }
    const struct DataBus& bus = globalConfig.data_buses[bus_id];
    uint32_t hz = bus.bus_speed_hz ? bus.bus_speed_hz : 100000u;
    int sda = (int)bus.pin_2;
    int scl = (int)bus.pin_1;
    if (s_wire_open_display_ready && s_wire_sda_pin == sda && s_wire_scl_pin == scl) {
        return true;
    }
    if (s_wire_open_display_ready) {
        od_hal_i2c_deinit();
        s_wire_open_display_ready = false;
    }
    if (!wireBeginForOpenDisplay(sda, scl, hz)) {
        s_wire_open_display_ready = false;
        return false;
    }
    return true;
#else
    (void)bus_id;
    initOrRestoreWireForOpenDisplay();
    return true;
#endif
}

void initOrRestoreWireForOpenDisplay(void) {
#ifdef TARGET_ESP32
    if (globalConfig.data_bus_count > 0 && i2cDataBusValid(0)) {
        (void)initOrRestoreWireForBus(0);
        return;
    }
    if (!s_wire_open_display_ready) {
        if (odI2cBegin(-1, -1, 100000u)) {
            s_wire_open_display_ready = true;
        }
    }
#else
    if (!openDisplayI2cBusConfigured()) {
        return;
    }
    if (i2cDataBusValid(0)) {
        const struct DataBus& bus = globalConfig.data_buses[0];
        od_hal_gpio_config_input(bus.pin_1, (bus.pullups & 0x01) != 0, false);
        od_hal_gpio_config_input(bus.pin_2, (bus.pullups & 0x02) != 0, false);
    }
    odI2cBegin(-1, -1, 100000u);
    if (i2cDataBusValid(0) && globalConfig.data_buses[0].bus_speed_hz > 0) {
        od_hal_i2c_set_clock(globalConfig.data_buses[0].bus_speed_hz);
    }
#endif
}

void initDataBuses(){
    od_log_info("=== Initializing Data Buses ===");
    if(globalConfig.data_bus_count == 0){
        od_log_info("No data buses configured");
        return;
    }
    for(uint8_t i = 0; i < globalConfig.data_bus_count; i++){
        struct DataBus* bus = &globalConfig.data_buses[i];
        if(bus->bus_type == 0x01){ // I2C bus
            od_log_info("Initializing I2C bus %u (instance %u)", i, bus->instance_number);
            if(bus->pin_1 == 0xFF || bus->pin_2 == 0xFF){
                od_log_error("ERROR: Invalid I2C pins for bus %u (SCL=%u, SDA=%u)", i, bus->pin_1, bus->pin_2);
                continue;
            }
            uint32_t busSpeed = (bus->bus_speed_hz > 0) ? bus->bus_speed_hz : 100000;
            if(i == 0){
                #ifdef TARGET_ESP32
                initOrRestoreWireForOpenDisplay();
                #endif
                #ifdef TARGET_NRF
                od_hal_gpio_config_input(bus->pin_1, false, false);
                od_hal_gpio_config_input(bus->pin_2, false, false);
                if(bus->pullups & 0x01){
                    od_hal_gpio_config_input(bus->pin_1, true, false);
                }
                if(bus->pullups & 0x02){
                    od_hal_gpio_config_input(bus->pin_2, true, false);
                }
                odI2cBegin(-1, -1, 100000u); // Uses default I2C pins
                od_hal_i2c_set_clock(busSpeed);
                od_log_info("NOTE: nRF52840 using default I2C pins (config pins: SCL=%u, SDA=%u)", bus->pin_1, bus->pin_2);
                #endif
                od_log_info("I2C bus %u initialized: SCL=pin%u, SDA=pin%u, Speed=%uHz", i, bus->pin_1, bus->pin_2, (unsigned)busSpeed);
            } else {
                od_log_info("I2C bus %u configured (init on demand): SCL=pin%u, SDA=pin%u, Speed=%uHz",
                    i, bus->pin_1, bus->pin_2, (unsigned)busSpeed);
            }
        }
        else if(bus->bus_type == 0x02){
            od_log_info("SPI bus %u detected (not yet implemented)", i);
            od_log_info("  Instance: %u", bus->instance_number);
        }
        else{
            od_log_warn("WARNING: Unknown bus type 0x%02X for bus %u", bus->bus_type, i);
        }
    }
    od_log_info("=== Data Bus Initialization Complete ===");
}

void initio(){
    od_log_info("[initio] >> LEDs"); od_log_flush();
    if(globalConfig.led_count > 0){
        for (uint8_t i = 0; i < globalConfig.led_count; i++) {
            struct LedConfig* led = &globalConfig.leds[i];
            bool invertRed = (led->led_flags & 0x01) != 0;
            bool invertGreen = (led->led_flags & 0x02) != 0;
            bool invertBlue = (led->led_flags & 0x04) != 0;
            bool invertLed4 = (led->led_flags & 0x08) != 0;
                if (led->led_1_r != 0xFF) {
                    od_hal_gpio_config_output(led->led_1_r, (invertRed ? HIGH : LOW));
                }
                if (led->led_2_g != 0xFF) {
                    od_hal_gpio_config_output(led->led_2_g, (invertGreen ? HIGH : LOW));
                }
                if (led->led_3_b != 0xFF) {
                    od_hal_gpio_config_output(led->led_3_b, (invertBlue ? HIGH : LOW));
                }
                if (led->led_4 != 0xFF) {
                    od_hal_gpio_config_output(led->led_4, (invertLed4 ? HIGH : LOW));
                }
        }
        for (uint8_t i = 0; i < globalConfig.led_count; i++) {
            if (globalConfig.leds[i].led_type == 0) {
                activeLedInstance = i;
#ifdef TARGET_NRF
                if (nrfVbusPresent())
#endif
                {
                    flashLed(0xE0, 15);
                    flashLed(0x1C, 15);
                    flashLed(0x03, 15);
                    flashLed(0xFF, 15);
                }
            }
        }
    }
    od_log_info("[initio] >> initPassiveBuzzers"); od_log_flush();
    initPassiveBuzzers();
    od_log_info("[initio] >> pwr_pin"); od_log_flush();
    if(globalConfig.system_config.pwr_pin != 0xFF){
    od_hal_gpio_config_output(globalConfig.system_config.pwr_pin, false);
    }
    else{
        od_log_warn("Power pin not set");
    }
    od_log_info("[initio] >> initDataBuses"); od_log_flush();
    initDataBuses();
    od_log_info("[initio] >> initSensors"); od_log_flush();
    initSensors();
    od_log_info("[initio] << done"); od_log_flush();
}

void scanI2CDevices(){
    od_log_info("=== Scanning I2C Bus for Devices ===");
    initOrRestoreWireForOpenDisplay();
    uint8_t deviceCount = 0;
    uint8_t foundDevices[128];
    for(uint8_t address = 0x08; address < 0x78; address++){
        uint8_t error = (uint8_t)od_hal_i2c_probe(address);
        if(error == 0){
            foundDevices[deviceCount] = address;
            deviceCount++;
            od_log_debug("I2C device found at address 0x%02X (%u)", address, address);
        }
        else if(error == 4){
            od_log_error("ERROR: Unknown error at address 0x%02X", address);
        }
    }
    if(deviceCount == 0){
        od_log_warn("No I2C devices found on bus");
    } else {
        od_log_debug("Found %u I2C device(s)", deviceCount);
        od_log_debug("Device addresses: ");
        char addrList[700];
        int pos = snprintf(addrList, sizeof(addrList), "%s", "");
        if (pos < 0) {
            pos = 0;
            addrList[0] = '\0';
        }
        for(uint8_t i = 0; i < deviceCount && pos < (int)sizeof(addrList); i++){
            int n = snprintf(addrList + pos, sizeof(addrList) - pos, i > 0 ? ", 0x%02X" : "0x%02X", foundDevices[i]);
            if (n < 0) {
                break;
            }
            pos += n;
        }
        od_log_debug("%s", addrList);
    }
    od_log_info("=== I2C Scan Complete ===");
}

void initSensors(){
    od_log_info("=== Initializing Sensors ===");
    if(globalConfig.sensor_count == 0){
        od_log_warn("No sensors configured");
        return;
    }
    for(uint8_t i = 0; i < globalConfig.sensor_count; i++){
        struct SensorData* sensor = &globalConfig.sensors[i];
        od_log_debug("Initializing sensor %u (instance %u)", i, sensor->instance_number);
        od_log_debug("  Type: 0x%04X", sensor->sensor_type);
        od_log_debug("  Bus ID: %u", sensor->bus_id);
        if(sensor->sensor_type == OD_SENSOR_TYPE_AXP2101){
            od_log_debug("  Detected AXP2101 PMIC sensor");
        }
        else if(sensor->sensor_type == OD_SENSOR_TYPE_TEMPERATURE){
            od_log_debug("  Temperature sensor (initialization not implemented)");
        }
        else if(sensor->sensor_type == OD_SENSOR_TYPE_HUMIDITY){
            od_log_debug("  Humidity sensor (initialization not implemented)");
        }
        else if(sensor->sensor_type == OD_SENSOR_TYPE_SHT40){
            od_log_debug("  SHT40 (I2C + MSD slot)");
        }
        else if(sensor->sensor_type == OD_SENSOR_TYPE_BQ27220){
            od_log_debug("  BQ27220 fuel gauge (MSD voltage + optional dynamic SOC/status bytes)");
        }
        else{
            od_log_warn("  Unknown sensor type 0x%04X", sensor->sensor_type);
        }
    }
    initSht40Sensors();
    initBq27220Sensors();
    od_log_info("=== Sensor Initialization Complete ===");
}

void initAXP2101(uint8_t busId){
    od_hal_gpio_config_output(21, false);
    od_hal_delay_ms(100);
    od_hal_gpio_write(21, true);
    od_log_info("=== Initializing AXP2101 PMIC ===");
    if(busId >= globalConfig.data_bus_count){
        od_log_error("ERROR: Invalid bus ID %u (only %u buses configured)", busId, globalConfig.data_bus_count);
        return;
    }
    struct DataBus* bus = &globalConfig.data_buses[busId];
    if(bus->bus_type != 0x01){
        od_log_error("ERROR: Bus %u is not an I2C bus", busId);
        return;
    }
    if(!initOrRestoreWireForBus(busId)){
        od_log_error("ERROR: Failed to (re)init I2C bus %u for AXP2101", busId);
        return;
    }
    uint8_t error = (uint8_t)od_hal_i2c_probe(AXP2101_SLAVE_ADDRESS);
    if(error != 0){
        od_log_error("ERROR: AXP2101 not found at address 0x%02X (error: %u)", AXP2101_SLAVE_ADDRESS, error);
        return;
    }
    od_log_debug("AXP2101 detected at address 0x%02X", AXP2101_SLAVE_ADDRESS);
    const uint8_t od_i2c_tx2 = (uint8_t)(AXP2101_REG_POWER_STATUS);
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, &od_i2c_tx2, 1);
    if(error == 0){
        uint8_t od_i2c_rx0 = 0;
        if (od_hal_i2c_read(AXP2101_SLAVE_ADDRESS, &od_i2c_rx0, 1) == OD_HAL_I2C_OK) {
            uint8_t status = od_i2c_rx0;
            od_log_debug("Power status: 0x%02X", status);
        }
    }
    const uint8_t od_i2c_tx3[2] = { (uint8_t)(AXP2101_REG_DC_VOL0_CTRL), (uint8_t)(0x12) };
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx3, 2);
    if(error == 0){
        od_log_debug("DCDC1 voltage set to 3.3V");
    } else {
        od_log_error("ERROR: Failed to set DCDC1 voltage");
    }
    od_hal_delay_ms(10);
    const uint8_t od_i2c_tx4 = (uint8_t)(AXP2101_REG_DC_ONOFF_DVM_CTRL);
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, &od_i2c_tx4, 1);
    uint8_t dcEnable = 0x00;
    if(error == 0){
        uint8_t od_i2c_rx1 = 0;
        if (od_hal_i2c_read(AXP2101_SLAVE_ADDRESS, &od_i2c_rx1, 1) == OD_HAL_I2C_OK) {
            dcEnable = od_i2c_rx1;
        }
    }
    dcEnable |= 0x01;
    const uint8_t od_i2c_tx5[2] = { (uint8_t)(AXP2101_REG_DC_ONOFF_DVM_CTRL), (uint8_t)(dcEnable) };
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx5, 2);
    if(error == 0){
        od_log_debug("DCDC1 enabled (3.3V)");
    } else {
        od_log_error("ERROR: Failed to enable DCDC1");
    }
    od_hal_delay_ms(10);
    const uint8_t od_i2c_tx6 = (uint8_t)(AXP2101_REG_LDO_ONOFF_CTRL0);
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, &od_i2c_tx6, 1);
    uint8_t aldoEnable = 0x00;
    if(error == 0){
        uint8_t od_i2c_rx2 = 0;
        if (od_hal_i2c_read(AXP2101_SLAVE_ADDRESS, &od_i2c_rx2, 1) == OD_HAL_I2C_OK) {
            aldoEnable = od_i2c_rx2;
        }
    }
    const uint8_t od_i2c_tx7 = (uint8_t)(AXP2101_REG_LDO_VOL2_CTRL);
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, &od_i2c_tx7, 1);
    uint8_t aldo3VolReg = 0x00;
    if(error == 0){
        uint8_t od_i2c_rx3 = 0;
        if (od_hal_i2c_read(AXP2101_SLAVE_ADDRESS, &od_i2c_rx3, 1) == OD_HAL_I2C_OK) {
            aldo3VolReg = od_i2c_rx3;
        }
    }
    aldo3VolReg = (aldo3VolReg & 0xE0) | 0x1C;
    const uint8_t od_i2c_tx8[2] = { (uint8_t)(AXP2101_REG_LDO_VOL2_CTRL), (uint8_t)(aldo3VolReg) };
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx8, 2);
    if(error == 0){
        od_log_debug("ALDO3 voltage set to 3.3V");
    }
    const uint8_t od_i2c_tx9 = (uint8_t)(AXP2101_REG_LDO_VOL3_CTRL);
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, &od_i2c_tx9, 1);
    uint8_t aldo4VolReg = 0x00;
    if(error == 0){
        uint8_t od_i2c_rx4 = 0;
        if (od_hal_i2c_read(AXP2101_SLAVE_ADDRESS, &od_i2c_rx4, 1) == OD_HAL_I2C_OK) {
            aldo4VolReg = od_i2c_rx4;
        }
    }
    aldo4VolReg = (aldo4VolReg & 0xE0) | 0x1C;
    const uint8_t od_i2c_tx10[2] = { (uint8_t)(AXP2101_REG_LDO_VOL3_CTRL), (uint8_t)(aldo4VolReg) };
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx10, 2);
    if(error == 0){
        od_log_debug("ALDO4 voltage set to 3.3V");
    }
    aldoEnable |= 0x0C;
    const uint8_t od_i2c_tx11[2] = { (uint8_t)(AXP2101_REG_LDO_ONOFF_CTRL0), (uint8_t)(aldoEnable) };
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx11, 2);
    if(error == 0){
        od_log_debug("ALDO3 and ALDO4 enabled (3.3V)");
    }
    const uint8_t od_i2c_tx12 = (uint8_t)(AXP2101_REG_POWER_WAKEUP_CTL);
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, &od_i2c_tx12, 1);
    if(error == 0){
        uint8_t od_i2c_rx5 = 0;
        if (od_hal_i2c_read(AXP2101_SLAVE_ADDRESS, &od_i2c_rx5, 1) == OD_HAL_I2C_OK) {
            uint8_t wakeupCtl = od_i2c_rx5;
            od_log_debug("Wakeup control: 0x%02X", wakeupCtl);
            if(wakeupCtl & 0x01){
                od_log_debug("Wakeup already enabled");
            } else {
                const uint8_t od_i2c_tx13[2] = { (uint8_t)(AXP2101_REG_POWER_WAKEUP_CTL), (uint8_t)(wakeupCtl | 0x01) };
                error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx13, 2);
                if(error == 0){
                    od_log_debug("Wakeup enabled");
                }
            }
        }
    }
    od_log_info("=== AXP2101 PMIC Initialization Complete ===");
}

void readAXP2101Data(){
    od_log_info("=== Reading AXP2101 PMIC Data ===");
    uint8_t error = (uint8_t)od_hal_i2c_probe(AXP2101_SLAVE_ADDRESS);
    if(error != 0){
        od_log_error("ERROR: AXP2101 not found at address 0x%02X", AXP2101_SLAVE_ADDRESS);
        return;
    }
    const uint8_t od_i2c_tx15[2] = { (uint8_t)(AXP2101_REG_ADC_CHANNEL_CTRL), (uint8_t)(0xFF) };
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx15, 2);
    od_hal_delay_ms(10);
    const uint8_t od_i2c_tx16 = (uint8_t)(AXP2101_REG_POWER_STATUS);
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, &od_i2c_tx16, 1);
    if(error == 0){
        uint8_t od_i2c_rx100[2] = { 0 };
        if (od_hal_i2c_read(AXP2101_SLAVE_ADDRESS, od_i2c_rx100, 2) == OD_HAL_I2C_OK) {
            uint8_t status1 = od_i2c_rx100[0];
            uint8_t status2 = od_i2c_rx100[1];
            od_log_debug("Power Status 1: 0x%02X", status1);
            od_log_debug("Power Status 2: 0x%02X", status2);
            bool batteryPresent = (status1 & 0x20) != 0;
            bool charging = (status1 & 0x04) != 0;
            bool vbusPresent = (status1 & 0x08) != 0;
            od_log_debug("Battery Present: %s", batteryPresent ? "Yes" : "No");
            od_log_debug("Charging: %s", charging ? "Yes" : "No");
            od_log_debug("VBUS Present: %s", vbusPresent ? "Yes" : "No");
        }
    }
    const uint8_t od_i2c_tx17 = (uint8_t)(AXP2101_REG_PWRON_STATUS);
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, &od_i2c_tx17, 1);
    if(error == 0){
        uint8_t od_i2c_rx6 = 0;
        if (od_hal_i2c_read(AXP2101_SLAVE_ADDRESS, &od_i2c_rx6, 1) == OD_HAL_I2C_OK) {
            uint8_t pwronStatus = od_i2c_rx6;
            od_log_debug("Power On Status: 0x%02X", pwronStatus);
        }
    }
    const uint8_t od_i2c_tx18 = (uint8_t)(AXP2101_REG_ADC_DATA_BAT_VOL_H);
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, &od_i2c_tx18, 1);
    if(error == 0){
        uint8_t od_i2c_rx101[2] = { 0 };
        if (od_hal_i2c_read(AXP2101_SLAVE_ADDRESS, od_i2c_rx101, 2) == OD_HAL_I2C_OK) {
            uint8_t batVolH = od_i2c_rx101[0];
            uint8_t batVolL = od_i2c_rx101[1];
            uint16_t batVolRaw = ((uint16_t)batVolH << 4) | (batVolL & 0x0F);
            float batVoltage = batVolRaw * 0.5;
            od_log_debug("Battery Voltage: %.1f mV (%.2f V)", batVoltage, batVoltage / 1000.0);
        }
    }
    const uint8_t od_i2c_tx19 = (uint8_t)(AXP2101_REG_ADC_DATA_VBUS_VOL_H);
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, &od_i2c_tx19, 1);
    if(error == 0){
        uint8_t od_i2c_rx102[2] = { 0 };
        if (od_hal_i2c_read(AXP2101_SLAVE_ADDRESS, od_i2c_rx102, 2) == OD_HAL_I2C_OK) {
            uint8_t vbusVolH = od_i2c_rx102[0];
            uint8_t vbusVolL = od_i2c_rx102[1];
            uint16_t vbusVolRaw = ((uint16_t)vbusVolH << 4) | (vbusVolL & 0x0F);
            float vbusVoltage = vbusVolRaw * 1.7;
            od_log_debug("VBUS Voltage: %.1f mV (%.2f V)", vbusVoltage, vbusVoltage / 1000.0);
        }
    }
    const uint8_t od_i2c_tx20 = (uint8_t)(AXP2101_REG_ADC_DATA_SYS_VOL_H);
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, &od_i2c_tx20, 1);
    if(error == 0){
        uint8_t od_i2c_rx103[2] = { 0 };
        if (od_hal_i2c_read(AXP2101_SLAVE_ADDRESS, od_i2c_rx103, 2) == OD_HAL_I2C_OK) {
            uint8_t sysVolH = od_i2c_rx103[0];
            uint8_t sysVolL = od_i2c_rx103[1];
            uint16_t sysVolRaw = ((uint16_t)sysVolH << 4) | (sysVolL & 0x0F);
            float sysVoltage = sysVolRaw * 1.4;
            od_log_debug("System Voltage: %.1f mV (%.2f V)", sysVoltage, sysVoltage / 1000.0);
        }
    }
    const uint8_t od_i2c_tx21 = (uint8_t)(AXP2101_REG_BAT_PERCENT_DATA);
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, &od_i2c_tx21, 1);
    if(error == 0){
        uint8_t od_i2c_rx7 = 0;
        if (od_hal_i2c_read(AXP2101_SLAVE_ADDRESS, &od_i2c_rx7, 1) == OD_HAL_I2C_OK) {
            uint8_t batPercent = od_i2c_rx7;
            if(batPercent <= 100){
                od_log_debug("Battery Percentage: %u%%", batPercent);
            } else {
                od_log_debug("Battery Percentage: Not available (fuel gauge may be disabled)");
            }
        }
    }
    const uint8_t od_i2c_tx22 = (uint8_t)(AXP2101_REG_DC_ONOFF_DVM_CTRL);
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, &od_i2c_tx22, 1);
    if(error == 0){
        uint8_t od_i2c_rx8 = 0;
        if (od_hal_i2c_read(AXP2101_SLAVE_ADDRESS, &od_i2c_rx8, 1) == OD_HAL_I2C_OK) {
            uint8_t dcEnable = od_i2c_rx8;
            od_log_debug("DC Enable Status: 0x%02X", dcEnable);
            od_log_debug("  DCDC1: %s", (dcEnable & 0x01) ? "ON" : "OFF");
            od_log_debug("  DCDC2: %s", (dcEnable & 0x02) ? "ON" : "OFF");
            od_log_debug("  DCDC3: %s", (dcEnable & 0x04) ? "ON" : "OFF");
            od_log_debug("  DCDC4: %s", (dcEnable & 0x08) ? "ON" : "OFF");
            od_log_debug("  DCDC5: %s", (dcEnable & 0x10) ? "ON" : "OFF");
        }
    }
    const uint8_t od_i2c_tx23 = (uint8_t)(AXP2101_REG_LDO_ONOFF_CTRL0);
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, &od_i2c_tx23, 1);
    if(error == 0){
        uint8_t od_i2c_rx9 = 0;
        if (od_hal_i2c_read(AXP2101_SLAVE_ADDRESS, &od_i2c_rx9, 1) == OD_HAL_I2C_OK) {
            uint8_t aldoEnable = od_i2c_rx9;
            od_log_debug("ALDO Enable Status: 0x%02X", aldoEnable);
            od_log_debug("  ALDO1: %s", (aldoEnable & 0x01) ? "ON" : "OFF");
            od_log_debug("  ALDO2: %s", (aldoEnable & 0x02) ? "ON" : "OFF");
            od_log_debug("  ALDO3: %s", (aldoEnable & 0x04) ? "ON" : "OFF");
            od_log_debug("  ALDO4: %s", (aldoEnable & 0x08) ? "ON" : "OFF");
        }
    }
    od_log_info("=== AXP2101 Data Read Complete ===");
}

