davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
void powerDownAXP2101(){
    od_log_info("=== Powering Down AXP2101 PMIC Rails ===");
    uint8_t error = (uint8_t)od_hal_i2c_probe(AXP2101_SLAVE_ADDRESS);
    if(error != 0){
        od_log_error("ERROR: AXP2101 not found at address 0x%02X (error: %u)", AXP2101_SLAVE_ADDRESS, error);
        return;
    }
    const uint8_t od_i2c_tx25[2] = { (uint8_t)(AXP2101_REG_IRQ_ENABLE1), (uint8_t)(0x00) };
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx25, 2);
    if(error == 0){
        const uint8_t od_i2c_tx26[2] = { (uint8_t)(AXP2101_REG_IRQ_ENABLE2), (uint8_t)(0x00) };
        error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx26, 2);
    }
    if(error == 0){
        const uint8_t od_i2c_tx27[2] = { (uint8_t)(AXP2101_REG_IRQ_ENABLE3), (uint8_t)(0x00) };
        error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx27, 2);
    }
    if(error == 0){
        const uint8_t od_i2c_tx28[2] = { (uint8_t)(AXP2101_REG_IRQ_ENABLE4), (uint8_t)(0x00) };
        error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx28, 2);
    }
    if(error == 0){
        const uint8_t od_i2c_tx29[2] = { (uint8_t)(AXP2101_REG_IRQ_STATUS1), (uint8_t)(0xFF) };
        error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx29, 2);
    }
    if(error == 0){
        const uint8_t od_i2c_tx30[2] = { (uint8_t)(AXP2101_REG_IRQ_STATUS2), (uint8_t)(0xFF) };
        error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx30, 2);
    }
    if(error == 0){
        const uint8_t od_i2c_tx31[2] = { (uint8_t)(AXP2101_REG_IRQ_STATUS3), (uint8_t)(0xFF) };
        error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx31, 2);
    }
    if(error == 0){
        const uint8_t od_i2c_tx32[2] = { (uint8_t)(AXP2101_REG_IRQ_STATUS4), (uint8_t)(0xFF) };
        error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx32, 2);
        if(error == 0){
            od_log_debug("All IRQs disabled and status cleared");
        }
    }
    const uint8_t od_i2c_tx33 = (uint8_t)(AXP2101_REG_DC_ONOFF_DVM_CTRL);
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, &od_i2c_tx33, 1);
    uint8_t dcEnable = 0x00;
    if(error == 0){
        uint8_t od_i2c_rx10 = 0;
        if (od_hal_i2c_read(AXP2101_SLAVE_ADDRESS, &od_i2c_rx10, 1) == OD_HAL_I2C_OK) {
            dcEnable = od_i2c_rx10;
        }
    }
    dcEnable &= 0x01;
    const uint8_t od_i2c_tx34[2] = { (uint8_t)(AXP2101_REG_DC_ONOFF_DVM_CTRL), (uint8_t)(dcEnable) };
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx34, 2);
    if(error == 0){
        od_log_debug("DC2-5 disabled (DC1 kept enabled)");
    } else {
        od_log_error("ERROR: Failed to disable DC2-5");
    }
    const uint8_t od_i2c_tx35[2] = { (uint8_t)(AXP2101_REG_LDO_ONOFF_CTRL1), (uint8_t)(0x00) };
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx35, 2);
    if(error == 0){
        od_log_debug("BLDO1-2, CPUSLDO, DLDO1-2 disabled");
    } else {
        od_log_error("ERROR: Failed to disable BLDO/CPUSLDO/DLDO rails");
    }
    const uint8_t od_i2c_tx36 = (uint8_t)(AXP2101_REG_LDO_ONOFF_CTRL0);
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, &od_i2c_tx36, 1);
    uint8_t aldoEnable = 0x00;
    if(error == 0){
        uint8_t od_i2c_rx11 = 0;
        if (od_hal_i2c_read(AXP2101_SLAVE_ADDRESS, &od_i2c_rx11, 1) == OD_HAL_I2C_OK) {
            aldoEnable = od_i2c_rx11;
        }
    }
    aldoEnable &= ~0x0F;
    const uint8_t od_i2c_tx37[2] = { (uint8_t)(AXP2101_REG_LDO_ONOFF_CTRL0), (uint8_t)(aldoEnable) };
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx37, 2);
    if(error == 0){
        od_log_debug("ALDO1-4 disabled");
    } else {
        od_log_error("ERROR: Failed to disable ALDO rails");
    }
    const uint8_t od_i2c_tx38 = (uint8_t)(AXP2101_REG_POWER_WAKEUP_CTL);
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, &od_i2c_tx38, 1);
    uint8_t wakeupCtrl = 0x00;
    if(error == 0){
        uint8_t od_i2c_rx12 = 0;
        if (od_hal_i2c_read(AXP2101_SLAVE_ADDRESS, &od_i2c_rx12, 1) == OD_HAL_I2C_OK) {
            wakeupCtrl = od_i2c_rx12;
        }
    }
    if(!(wakeupCtrl & 0x04)) {
        wakeupCtrl |= 0x04;
    }
    if(wakeupCtrl & 0x08) {
        wakeupCtrl &= ~0x08;
    }
    if(!(wakeupCtrl & 0x10)) {
        wakeupCtrl |= 0x10;
    }
    wakeupCtrl |= 0x80;
    const uint8_t od_i2c_tx39[2] = { (uint8_t)(AXP2101_REG_POWER_WAKEUP_CTL), (uint8_t)(wakeupCtrl) };
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx39, 2);
    if(error == 0){
        od_log_debug("AXP2101 wake-up configured and sleep mode enabled");
    } else {
        od_log_error("ERROR: Failed to configure AXP2101 sleep mode");
    }
    const uint8_t od_i2c_tx40[2] = { (uint8_t)(AXP2101_REG_ADC_CHANNEL_CTRL), (uint8_t)(0x00) };
    error = od_hal_i2c_write(AXP2101_SLAVE_ADDRESS, od_i2c_tx40, 2);
    if(error == 0){
        od_log_debug("All ADC channels disabled");
    } else {
        od_log_error("ERROR: Failed to disable ADC channels");
    }
    od_log_info("=== AXP2101 PMIC Rails Powered Down ===");
}

static void renderChar_4BPP(uint8_t* rowBuffer, const uint8_t* fontData, int fontRow, int charIdx, int startX, int charWidth, int pitch, int fontScale) {
    for (int col = 0; col < charWidth; col += fontScale) {
        uint8_t fontByte;
        int fontCol = col / fontScale;
        if (fontCol == 0 || fontCol > 7) {
            fontByte = 0x00;
        } else {
            fontByte = fontData[fontCol - 1];
        }
        uint8_t pixelBit = (fontByte >> fontRow) & 0x01;
        uint8_t pixelNibble = (pixelBit == 1) ? 0x0 : 0xF;
        for (int s = 0; s < fontScale; s++) {
            int pixelX = startX + charIdx * charWidth + col + s;
            if (pixelX >= globalConfig.displays[0].pixel_width) break;
            int bytePos = pixelX / 2;
            if (bytePos >= pitch) break;
            if ((pixelX % 2) == 0) {
                rowBuffer[bytePos] = (rowBuffer[bytePos] & 0x0F) | (pixelNibble << 4);
            } else {
                rowBuffer[bytePos] = (rowBuffer[bytePos] & 0xF0) | pixelNibble;
            }
        }
    }
}

