davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
    if (panel_uses_pixel_ram_x(pBBEP)) {
        partial_set_pixel_ram_x(pBBEP, x, cx);
    } else {
        int tx = x / 8;
        bbepWriteCmd(pBBEP, SSD1608_SET_RAMXPOS);
        uc[0] = (uint8_t)tx;
        uc[1] = (uint8_t)(tx + ((cx - 1) >> 3));
        bbepWriteData(pBBEP, uc, 2);
        bbepCMD2(pBBEP, SSD1608_SET_RAMXCOUNT, (uint8_t)tx);
    }

    if (panel_uses_ep426_x_decrement(pBBEP)) {
        partial_set_ep426_ram_y(pBBEP, ty, cy);
    } else if (panel_uses_ep397_y_decrement(pBBEP)) {
        partial_set_ep397_ram_y(pBBEP, ty, cy);
    } else {
        bbepWriteCmd(pBBEP, SSD1608_SET_RAMYPOS);
        uc[0] = (uint8_t)ty;
        uc[1] = (uint8_t)(ty >> 8);
        uc[2] = (uint8_t)(ty + cy - 1);
        uc[3] = (uint8_t)((ty + cy - 1) >> 8);
        bbepWriteData(pBBEP, uc, 4);
        uc[0] = (uint8_t)ty;
        uc[1] = (uint8_t)(ty >> 8);
        bbepWriteCmd(pBBEP, SSD1608_SET_RAMYCOUNT);
        bbepWriteData(pBBEP, uc, 2);
    }
    bbepWaitBusy(pBBEP);
}

static bool partial_consume_bytes(uint8_t* data, uint32_t len) {
    if (partialCtx.compressed) {
        if (len > UINT32_MAX - partialCtx.bytes_received) return false;
    } else {
        if (partialCtx.bytes_received > partialCtx.expected_stream_size ||
            len > partialCtx.expected_stream_size - partialCtx.bytes_received) {
            return false;
        }
    }
    partialCtx.bytes_received += len;
    if (partialCtx.compressed) return zlib_stream_to_partial_write(data, len, false);
    return partial_write_stream_bytes(data, len);
}

static bool zlib_stream_to_direct_write(const uint8_t* data, uint32_t len, bool final) {
    od_zlib_status_t status = od_zlib_stream_push(data, len, final);
    if (status == OD_ZLIB_STATUS_ERROR) {
        const char* zlibErr = od_zlib_stream_error();
        od_log_error("zlib stream error: %s", zlibErr);
        return false;
    }

    for (;;) {
        size_t bytesOut = 0;
        status = od_zlib_stream_poll(decompressionChunk, OPENDISPLAY_DECOMPRESSION_CHUNK_SIZE, &bytesOut);
        if (bytesOut > 0) {
#if defined(TARGET_ESP32) && defined(OPENDISPLAY_FASTEPD)
            if (fastepd_driver_used()) {
                fastepd_direct_write_chunk(decompressionChunk, (uint32_t)bytesOut);
                directWriteBytesWritten += (uint32_t)bytesOut;
            } else
#endif
            if (directWriteIsGray4() || directWriteBitplanes) {
                uint32_t before = directWriteBytesWritten;
                streamGray4Bytes(decompressionChunk, (uint32_t)bytesOut);
                if (directWriteBytesWritten - before != (uint32_t)bytesOut) {
                    return false;
                }
            } else
            {
                directWriteSinkBytes(decompressionChunk, (uint32_t)bytesOut);
            }
            if (directWriteBytesWritten > directWriteDecompressedTotal) {
                return false;
            }
        }
        if (status == OD_ZLIB_STATUS_OUTPUT_READY) continue;
        if (status == OD_ZLIB_STATUS_NEEDS_INPUT) return !final;
        if (status == OD_ZLIB_STATUS_DONE) {
            if (directWriteBytesWritten != directWriteDecompressedTotal) {
                return false;
            }
            return true;
        }
        const char* zlibErr = od_zlib_stream_error();
        od_log_error("zlib stream error: %s", zlibErr);
        return false;
    }
}

static bool zlib_stream_to_partial_write(const uint8_t* data, uint32_t len, bool final) {
    od_zlib_status_t status = od_zlib_stream_push(data, len, final);
    if (status == OD_ZLIB_STATUS_ERROR) {
        const char* zlibErr = od_zlib_stream_error();
        od_log_error("partial zlib stream error: %s", zlibErr);
        return false;
    }

    for (;;) {
        size_t bytesOut = 0;
        status = od_zlib_stream_poll(decompressionChunk, OPENDISPLAY_DECOMPRESSION_CHUNK_SIZE, &bytesOut);
        if (bytesOut > 0 && !partial_write_stream_bytes(decompressionChunk, (uint32_t)bytesOut)) return false;
        if (status == OD_ZLIB_STATUS_OUTPUT_READY) continue;
        if (status == OD_ZLIB_STATUS_NEEDS_INPUT) return !final;
        if (status == OD_ZLIB_STATUS_DONE) return partialCtx.bytes_written == partialCtx.expected_stream_size;
        const char* zlibErr = od_zlib_stream_error();
        od_log_error("partial zlib stream error: %s", zlibErr);
        return false;
    }
}

static bool partial_write_stream_bytes(uint8_t* data, uint32_t len) {
#if defined(TARGET_ESP32) && defined(OPENDISPLAY_FASTEPD)
    if (fastepd_driver_used()) {
        if (partialCtx.bytes_written > partialCtx.expected_stream_size ||
            len > partialCtx.expected_stream_size - partialCtx.bytes_written) {
            return false;
        }
        if (!fastepd_partial_write_chunk(data, len)) return false;
        partialCtx.bytes_written += len;
        return true;
    }
#endif
    uint32_t offset = 0;
    while (offset < len) {
        if (partialCtx.bytes_written >= partialCtx.expected_stream_size) return false;

        uint8_t targetPlane = partialCtx.bytes_written < partialCtx.plane_size ? PLANE_1 : PLANE_0;
        if (partialCtx.current_plane != targetPlane) {
            if (targetPlane == PLANE_0 && partialCtx.bytes_written != partialCtx.plane_size) return false;
            partial_set_addr_window(&bbep, partialCtx.x, partialCtx.y, partialCtx.width, partialCtx.height);
            bbepStartWrite(&bbep, targetPlane);
            partialCtx.current_plane = targetPlane;
        }

        uint32_t planeEnd = targetPlane == PLANE_1 ? partialCtx.plane_size : partialCtx.expected_stream_size;
        uint32_t chunk = planeEnd - partialCtx.bytes_written;
        if (chunk > len - offset) chunk = len - offset;
        bbepWriteData(&bbep, data + offset, (int)chunk);
        partialCtx.bytes_written += chunk;
        offset += chunk;
    }
    return true;
}

static bool partial_trigger_refresh(int refreshMode) {
    if (refreshMode < 0 || refreshMode > 3) refreshMode = REFRESH_PARTIAL;
    if (panel_skips_reinit_on_partial_refresh(&bbep)) {
        if (panel_uses_ep397_y_decrement(&bbep)) {
            static const uint8_t u8CMDz3[4] = {0xf7, 0xd7, 0xff, 0};
            bbepCMD2(&bbep, SSD1608_DISP_CTRL2, u8CMDz3[refreshMode]);
        } else {
            static const uint8_t u8CMD[4] = {0xf7, 0xc7, 0xff, 0xc0};
            bbepCMD2(&bbep, SSD1608_DISP_CTRL2, u8CMD[refreshMode]);
        }
        bbepWriteCmd(&bbep, SSD1608_MASTER_ACTIVATE);
        return waitforrefresh(60);
    }
    bbepRefresh(&bbep, refreshMode);
    return waitforrefresh(60);
}

