davelee98/Firmware_Unified/targets/esp32-idf/src/display_service.cpp
static void partial_prepare_panel_ram(void) {
    // Delta in ms since function entry, to profile where prep wall-clock goes.
    uint32_t t0 = od_hal_uptime_ms();
    od_log_debug("[+%ums] EPD partial start: acquire panel session", (unsigned)(od_hal_uptime_ms() - t0));
    // Acquire subsumes pwrmgm(true) + bbepInitIO + bbepWakeUp + init-seq resend.
    // Warm re-acquire skips the ~900 ms rail bring-up + bbepInitIO (Phase 1).
    bool cold = epdSessionAcquire(true);
    od_log_debug("[+%ums] after epdSessionAcquire (%s)", (unsigned)(od_hal_uptime_ms() - t0), cold ? "cold" : "warm");
#if defined(TARGET_ESP32) && defined(OPENDISPLAY_FASTEPD)
    if (fastepd_driver_used()) {
        fastepd_partial_prepare(partialCtx.x, partialCtx.y, partialCtx.width, partialCtx.height);
        od_log_debug("[+%ums] FastEPD partial prepare done", (unsigned)(od_hal_uptime_ms() - t0));
        return;
    }
#endif
    // The two white fills guarantee PLANE_0 == PLANE_1 OUTSIDE the rect so uninit
    // controller RAM can't flash noise during MASTER_ACTIVATE. A full-frame rect's
    // enforced plane_size*2 stream overwrites 100% of both planes, so there is no
    // "outside the rect" to protect — provably safe to skip even on a cold panel
    // (Phase 1 skip condition 1). Sub-rects still fill.
    bool fullFrame = partialCtx.x == 0 && partialCtx.y == 0 &&
                     partialCtx.width  == globalConfig.displays[0].pixel_width &&
                     partialCtx.height == globalConfig.displays[0].pixel_height;
    if (!fullFrame) {
        bbepFill(&bbep, BBEP_WHITE, PLANE_1);
        bbepFill(&bbep, BBEP_WHITE, PLANE_0);
        od_log_debug("[+%ums] after fills (ran: sub-rect)", (unsigned)(od_hal_uptime_ms() - t0));
    } else {
        od_log_debug("[+%ums] fills skipped (full-frame rect)", (unsigned)(od_hal_uptime_ms() - t0));
    }
}

static bool partial_write_to_panel(int refreshMode) {
    od_log_info("EPD refresh: PARTIAL (raw rect %u,%u %ux%u)",
                partialCtx.x, partialCtx.y, partialCtx.width, partialCtx.height);

    if (partialCtx.bytes_written != partialCtx.expected_stream_size) return false;
    epdRefreshInProgress = true;
    bool refreshSuccess = false;
#if defined(TARGET_ESP32) && defined(OPENDISPLAY_FASTEPD)
    if (fastepd_driver_used()) {
        refreshSuccess = fastepd_partial_refresh(refreshMode);
    } else
#endif
    {
        refreshSuccess = partial_trigger_refresh(refreshMode);
    }
    endRefresh();
    // A successful partial refresh leaves both controller planes consistent.
    if (refreshSuccess) epdPlanesPrepared = true;
    // Release keeps the panel warm (rail/SPI up, controller awake) on success;
    // powers it fully down on failure or on AXP2101 (window 0) boards.
    epdSessionRelease(refreshSuccess);
    return refreshSuccess;
}

static uint32_t calc_controller_plane_bytes(uint16_t width, uint16_t height) {
    return ((uint32_t)(width + 7u) / 8u) * height;
}

static uint32_t parse_be_u32(const uint8_t* data) {
    return ((uint32_t)data[0] << 24) | ((uint32_t)data[1] << 16) |
           ((uint32_t)data[2] << 8)  |  (uint32_t)data[3];
}

static void send_direct_write_nack(uint8_t opcode, uint8_t error, bool cleanupState) {
    displayed_etag = 0;
    if (cleanupState) {
        if (partialCtx.active) cleanup_partial_write_state();
        else cleanupDirectWriteState(false);
    }
    uint8_t errResponse[] = {RESP_NACK, opcode, error, 0x00};
    sendResponse(errResponse, sizeof(errResponse));
}

// See display_service.h for why this exists rather than main.cpp calling SPI.end() itself.
//
// The REAL implementation is in display_fastepd.cpp, which is the file that legitimately owns
// the FastEPD vendor adapter. This is the fallback for boards that compile no FastEPD at all,
// and it is a NO-OP BY PROOF rather than by assumption: the adapter's bus is only ever brought
// up by SPI.beginTransaction(), whose only callers are FastEPD.inl and display_fastepd.cpp --
// both compiled out here -- so compat SPI's _bus_ok is always false and the SPI.end() this
// replaces could never have freed anything on such a board.
//
// Since the E1004 payload moved to od_bbep_stream_write() (2026-08-04), display_service.cpp
// has no adapter dependency at all, which is why <SPI.h> is gone from it. The bb_epaper bus is
// released by bbepDeInitIO(), called from the panel force-off path above.
#if !defined(OPENDISPLAY_FASTEPD)
void displayReleaseSpiBus(void) { }
#endif
